Revit 2026 API

# RailingIsValidPathForRailing Method

---

Checks whether a railing can be created along a railing path.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidPathForRailing(
	CurveLoop curveLoop
)
```
```vb
Public Shared Function IsValidPathForRailing (
	curveLoop As CurveLoop
) As Boolean
```
```cpp
public:
static bool IsValidPathForRailing(
	CurveLoop^ curveLoop
)
```
```fsharp
static member IsValidPathForRailing :
        curveLoop : CurveLoop -> bool
```

#### Parameters

curveLoop CurveLoop
     The railing path along which the new railing will be created.

#### Return Value

Boolean True if the new railing path can be used in a railing definition, False otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The railing path should be located on the same horizontal plane and it should contain lines or arcs only. It also has to be continuous and its three or more curves cannot meet in one end point.

#### Reference

Railing Class

Autodesk.Revit.DB.Architecture Namespace